blog-posts/2003-04-14-the-wonderful-world-of-emacs-plannerel-emacs-planner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Wonderful World of Emacs &#x2013; planner.el &#x2014; emacs, planner</title>
<!-- 2015-10-19 Mon 14:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">The Wonderful World of Emacs &#x2013; planner.el &#x2014; emacs, planner</h1>
<p>
April 14th, 2003 -
<a href="http://sachachua.com/blog/p/690"><a href="http://sachachua.com/blog/p/690">http://sachachua.com/blog/p/690</a></a>
</p>

<p>
Migs, the one who wrote in recently about non-working
<a href="http://sachachua.com/notebook/wiki/Year2003">Year2003</a>,
 <a href="http://sachachua.com/notebook/wiki/Year2002">Year2002</a> and
<a href="http://sachachua.com/notebook/wiki/Year2001">Year2001</a> links, has
this to ask:
</p>

<blockquote>
<p>
I'm very curious as to how you get so much done with a
 console based (?) text editor. Like do you have sort of summary view
 of your calendar, tasks, etc in emacs? Maybe you can post a few
 screenshots of what you look at everyday. Personally, I'd be lost
 without an app like Evolution or Korganizer. I can't imagine how you
 manage all that with emacs.
</p>
</blockquote>

<p>
Migs, that is precisely it. =)
<a href="http://sachachua.com/notebook/emacs/planner.el">planner.el</a> is an
Emacs module that
 gives me a summary view of my tasks, schedule, and notes inside Emacs
 (which incidentally has a nice graphical interface, too). Together
 with
<a href="http://sachachua.com/notebook/emacs/emacs-wiki.el">emacs-wiki.el</a>, it
lets me easily manage
<a href="http://richip.dhs.org/~sachac/notebook/wiki/WelcomePage.php">my
website</a>. Another
 ultra-handy thing is M-x remember from
<a href="http://sachachua.com/notebook/emacs/remember.el">remember.el</a>, which
pops up a
 buffer asking me what I want to remember and stores a note in my daily
 planner page. For example, this is one such note created by
 remember.el. A patch contributed by Thomas Gehrlein allows easy
 navigation of planner pages &#x2013; simply select dates from M-x calendar.
</p>

<p>
Personally, I prefer this text-file-based system to Evolution or
 Korganizer. I remember dropping down to M-x grep to quickly search for
 something in my daily planner files. I can backup my data files in a
 .tar.gz. I can perform diffs and version control (although I haven't
 gotten around to doing so yet! =) ). I can even run it in
 conjunction with the Remembrance Agent.
</p>

<p>
My tasks and notes can be linked to my address book through BBDB
 integration with Planner, and I've modified the BBDB url support to
 take advantage of certain fields in my database. For example, typing
 Sacha Chua results in the
 following link: Sacha Chua. Locally, this brings up the address book
 record that matches that regular expression. On the Web, it is
 transformed into a URL following these rules of preference: blog, web,
 e-mail. That allows me to link to other people and even sites much
 more easily than HTML or the usual blogging systems might let me do,
 since HTML and <a href="http://www.blogger.com"><a href="http://www.blogger.com">http://www.blogger.com</a></a> still
require me to type the
 URLs to which I want to link.
</p>

<p>
Because all of these things run inside
<a href="http://www.gnu.org/software/emacs/">GNU Emacs</a>, I can easily
 access all of my data. I can embed Emacs LISP code into my planner
 files and have them automatically evaluated and displayed. I can
 switch to my planner file easily from my IRC chat session or from my
 mail. I can hook into built-in Emacs functionality or make use of
 modules developed by other people. It's tons of fun!
</p>

<p>
And I didn't even write planner.el. Ubercoder
<a href="http://newartisans.com/johnw/">John Wiegley</a> did. I
 discovered planner.el around 2001.11.03. I liked it so much I e-mailed
 John Wiegley to volunteer tech support and bugfixing for it, and he
 suggested that I take over maintaining planner.el
 instead. (2002.11.21) Open source is so much fun! =)
</p>

<p>
To see a sample of the text files I work with, you can check out my
 planner directory at
<a href="http://richip.dhs.org/~sachac/notebook/plans/"><a href="http://richip.dhs.org/~sachac/notebook/plans/">http://richip.dhs.org/~sachac/notebook/plans/</a></a>
.
 The published files are listed at
</p>

<p>
<a href="http://richip.dhs.org/~sachac/notebook/wiki/WikiIndex.php"><a href="http://richip.dhs.org/~sachac/notebook/wiki/WikiIndex.php">http://richip.dhs.org/~sachac/notebook/wiki/WikiIndex.php</a></a>.
</p>

<p>
People interested in duplicating my setup may want to check out my
 configuration files. They are all found in my
<a href="http://sachachua.com/notebook/emacs/">notebook/emacs/</a>
 directory. Files of interest are
<a href="http://sachachua.com/notebook/emacs/planner-config.el">planner-config.el</a>,
</p>

<p>
<a href="http://sachachua.com/notebook/emacs/emacs-wiki-config.el">emacs-wiki-config.el</a>,
and
<a href="http://sachachua.com/notebook/emacs/remember-config.el">remember-config.el</a>.
Please write to me
 at <a href="mailto:sacha@free.net.ph">sacha@free.net.ph</a> if you have any
comments or suggestions, and
 don't hesitate to ask for help in setting up a wonderful personal
 information management system in Emacs.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
